{
    "profile": {
        "name": "Bernardo Luís",
        "birthday": "1989-05-06",
        "location": "Madeira, Portugal",
        "job_title": "Mobile Tech Lead",
        "email": "bernardo.luis@ealgorithm.net"
    },
    "about": "I am deeply enthusiastic about coding and take immense pleasure in working alongside a dynamic, multi-disciplinary team where their creativity can spur me to bring out my best work. During my free time, I enjoy the company of my beloved family and friends. Ultimately, I cherish a relaxed environment where I can enjoy a hearty laugh over some great jokes.",
    "work_experience": [
        {
            "logo": "images/ic_nec_512.png",
            "company": "NEC Corporation",
            "position": "Android Tech Lead",
            "startDate": "November 2021",
            "duration": "November 2021 - Present (1 year 6 months)",
            "location": "Madeira, Portugal",
            "description": "As the lead developer for the Android projects, I am responsible for its development and direction. In addition, I conducted an analysis of the mobile department's development process and worked with a colleague on the iOS team to restructure the department.\n\nThrough this process, we implemented improvements to the development process such as modularization of components, and continuous integration and distribution processes.",
            "responsibilities": [
              "Restructuring internal and external SDKs for use in several projects;",
              "Developing native Android apps;",
              "Managing internal continuous integration and distribution processes;"
            ]
        },
        {
            "logo": "images/ic_beatstars_512.png",
            "company": "BeatStars",
            "position": "Mobile Team Leader (Android and iOS)",
            "startDate": "February 2018",
            "endDate": "September 2021",
            "duration": "February 2018 - September 2021 (3 years 8 months)",
            "location": "Madeira, Portugal",
            "description": "As the Mobile Team Leader for both Android and iOS development, I was responsible for coordinating with other departments at BeatStars to ensure seamless integration of mobile development efforts.\n\nIn addition to leading the development of the BeatStars Marketplace for Android and iOS, I was maintaining and updating previously released apps while keeping abreast of the latest technologies and trends in the market.",
            "responsibilities": [
              "Development of native apps for iOS and Android;",
              "Defining the technologies to use in Android and iOS;",
              "Serving as a UX design consultant;"
            ]
        },
        {
            "logo": "images/ic_frontkom_512.png",
            "company": "Frontkom",
            "position": "Android and iOS Developer",
            "startDate": "March 2017",
            "endDate": "February 2018",
            "duration": "March 2017 - February 2018 (1 year)",
            "location": "Madeira, Portugal",
            "description": "I developed native Android and iOS applications for several type of business. Among them multimedia, healthcare, education and others. I also developed hybrid apps in Ionic platform and created native plugins to be used in other projects.",
            "responsibilities": [
               "Development of native apps for iOS and Android;",
               "Development of hybrid apps in Ionic Platform;",
               "Manage App Build in Markets (AppStore and Google Play);",
               "Communication with the Team and Clients;"
            ]
        },
        {
            "logo": "images/ic_tvappagency_512.png",
            "company": "TV App Agency",
            "position": "Team Leader - Software Developer",
            "duration": "July 2016 - December 2018 (2 years 5 months)",
            "startDate": "July 2016",
            "endDate": "December 2018",
            "location": "Funchal, Madeira",
            "description": "I started the mobile department in the company and I was responsible for the Android development. I defined the standards to use in Android development and develop several applications for Smartphone and Tablet.",
            "responsibilities": [
              "Team management and code review;",
              "Project planning and structuring;",
              "Defining technologies to use in Android application development, web, and smart TV;",
              "Providing support to other developers;",
              "Communication with the team and clients;"
            ]
        },
        {
            "logo": "images/ic_loopbug_512.png",
            "company": "startWEB",
            "position": "Entrepreneur | Software Developer",
            "location": "Funchal, Madeira",
            "duration": "June 2013 - October 2014 (1 year 5 months)",
            "startDate": "June 2013",
            "endDate": "October 2014",
            "description": "I entered in a competition startWeb 2013 with more 3 colleagues, where we design and concept an idea. We were one of the 3 teams select and we got a money incentive to develop our idea.\n\nOur idea was do educational games for children from ages 3 to 6 and gather several informations through the games to share the kids progress with the parents and the teachers.",
            "responsibilities": [
              "Design and concept of educational games for children from ages 3 to 6;",
              "Development of mobile and web apps (CMS, API's and webservices to support several apps);"
            ]
        }  
    ]

}